{
  "sugar": "A sweetener that adds calories and increases blood sugar levels.",
  "palm oil": "High in saturated fat; not ideal for heart health.",
  "msg": "Flavor enhancer that may cause sensitivity reactions in some individuals.",
  "dextrose": "A form of sugar that rapidly spikes blood glucose.",
  "citric acid": "A preservative and acidity regulator commonly found in soft drinks.",
  "artificial flavor": "Synthetic compounds that mimic natural flavors; may cause sensitivity.",
  "sodium benzoate": "A preservative that can form benzene when combined with vitamin C.",
  "tartrazine": "A synthetic yellow food dye (E102); may cause hyperactivity in children.",
  "aspartame": "A low-calorie artificial sweetener; avoid in PKU condition.",
  "sucralose": "A zero-calorie sweetener; may disrupt gut microbiota.",
  "caramel color": "Used in colas and brown drinks; may contain 4-MEI, a potential carcinogen.",
  "high fructose corn syrup": "Linked to obesity and insulin resistance.",
  "stabilizer 415": "Xanthan gum, used to stabilize and thicken foods.",
  "sodium cyclamate": "Artificial sweetener banned in some countries.",
  "acesulfame potassium": "Zero-calorie sweetener; long-term safety debated.",
  "caffeine": "Stimulant found in coffee, tea, and cola drinks.",
  "salt": "Essential in moderation; excess can raise blood pressure.",
  "edta": "Preservative preventing discoloration and spoilage.",
  "milk solids": "Adds creaminess and protein; present in dairy drinks.",
  "natural flavors": "Extracts from real sources; vague labeling may hide allergens.",
  "synthetic food color": "Linked to behavioral issues in sensitive children.",
  "maltodextrin": "Used as thickener; spikes blood sugar quickly.",
  "emulsifier 322": "Lecithin, used to keep ingredients blended; safe.",
  "preservative 211": "Sodium benzoate, common in soft drinks and juices.",
  "sorbitol": "Sugar alcohol used in sugar-free foods; may cause bloating.",
  "gelatin": "Derived from animal collagen; not suitable for vegetarians.",
  "sodium citrate": "Acidity regulator used in sodas and packaged drinks.",
  "guar gum": "Natural thickener from guar beans; usually safe.",
  "cream": "Rich dairy ingredient; high in saturated fat.",
  "cardamom": "Used in chai and sweets; has digestive benefits.",
  "saffron": "Used in kesar milk and sweets; antioxidant-rich.",
  "turmeric": "Anti-inflammatory spice used widely in Indian cooking."
}
